import React from 'react';
import './stylecon.css'; // Import CSS file
import enImage from '../assets/en1.jpg'; // นำเข้ารูปภาพ
import en1Image from '../assets/enn.jpg'; // นำเข้ารูปภาพ
import en2Image from '../assets/en3.jpg'; // นำเข้ารูปภาพ
import img4 from '../assets/enn1.jpg';
import img5 from '../assets/enn2.jpg';
import img6 from '../assets/enn3.jpg';
import img7 from '../assets/enn4.jpg';
import img8 from '../assets/enn5.jpg';
import img9 from '../assets/enn6.jpg';
import img10 from '../assets/enn7.jpg';
import img11 from '../assets/enn8.jpg';

const BusConcert = () => {
  // เก็บรูปภาพใน array
  const images = [img4, img5,
    img6, img7, img8, img9,
    img10, img11,
  ];

  return (
    <div className="bus-concert-container">
      <h1>ENHYPEN</h1>
      <p className="text-en-image">ᴇɴʜʏᴘᴇɴ คัมแบ็คอัลบั้มหมายเลขสอง และ “xᴏ (ᴏɴʟʏ ɪꜰ ʏᴏᴜ ꜱᴀʏ ʏᴇꜱ)”   7 หนุ่มพร้อมทุ่มเททุกอย่างเพื่อ ‘ความรัก’ ขอแค่คุณอนุญาตเท่านั้นแหละ!</p>
      <img src={enImage} alt="Enhypen Concert" className="bus-concert-image" />
     
      
      <p className="text-en-image1">หนึ่งในบอยแบนด์ที่โดดเด่นที่สุดนาทีนี้ “ᴇɴʜʏᴘᴇɴ” 
        เปิดบทใหม่บนเส้นทางสายดนตรีกับสตูดิโออัลบั้มชุดที่ 2 “ʀᴏᴍᴀɴᴄᴇ : ᴜɴᴛᴏʟᴅ” 
        ที่นำเสนอความหวานยิ่งขึ้่น และน่ารักยิ่งขึ้นผ่านเสียงดนตรีโดย 7 หนุ่ม ᴊᴜɴɢᴡᴏɴ, ʜᴇᴇꜱᴇᴜɴɢ, ᴊᴀʏ, ᴊᴀᴋᴇ, ꜱᴜɴɢʜᴏᴏɴ, ꜱᴜɴᴏᴏ และ ɴɪ-ᴋɪ
        “จนถึงตอนนี้พวกเรากลับมาพร้อมกับสไตล์ดนตรีที่แตกต่างกันทุกครั้ง เพลงของเราเป็นไปตามเนื้อเรื่องของแต่ละอัลบั้ม 
        และในครั้งนี้เรามุ่งเน้นไปที่แนวคิดเรื่องความโรแมนติกและความรักครับ 
        มันคือการเปลี่ยนแปลงที่สดใสขึ้นกว่าเพลงแนวมืดดาร์กๆที่พวกเราเป็นที่รู้จักก่อนหน้านี้ 
        เราสามารถเปลี่ยนแปลงได้เสมอตามประสบการณ์หรือทิศทางของเรา ณ ตอนนั้นครับ” ᴊᴜɴɢᴡᴏᴏ กล่าว</p> 
        <img src={en1Image} alt="Enhypen Concert" className="bus-concert-image" />
      
   
 <p className="text-en-image1">“ʀᴏᴍᴀɴᴄᴇ: ᴜɴᴛᴏʟᴅ” มาเป็นอัลบั้มเต็มของ ᴇɴʜʏᴘᴇɴ ในรอบสองปีและเก้าเดือนหากนับจากอัลบั้มเต็มชุดแรก “ᴅɪᴍᴇɴꜱɪᴏɴ: ᴅɪʟᴇᴍᴍᴀ” (2021) ในอัลบั้มเต็มชุดที่สองชุดนี้ของพวกเขามีทั้งหมด 10 เพลง โดยเป็นเพลงที่ถ่ายทอดอารมณ์ที่ยังไม่สุกงอมของชายหนุ่มอีกครั้ง ดังที่วงทำมาโดยตลอดนับตั้งแต่เปิดตัวในปี 2020 โดยเน้นไปที่อารมณ์ที่ยังไม่เติบโตเป็นผู้ใหญ่แต่บริสุทธิ์ซึ่งเกิดขึ้นท่ามกลางความหลงใหลในความโรแมนติก
“นี่เป็นการเริ่มเรื่องราวโรแมนติกบทใหม่สำหรับเรา” ꜱᴜɴᴏᴏ กล่าว “ก่อนหน้านี้คือเป็นซีรีส์ ʙʟᴏᴏᴅ แต่ตอนนี้เริ่มต้นซีรีส์ ʀᴏᴍᴀɴᴄᴇ ครับ เราเตรียมตัวมามากจริงๆ ดังนั้นเราหวังว่าคุณจะตั้งตารอสิ่งที่เรานำเสนอนะครับ”
“เราอยากกลับมาพร้อมกับอัลบั้มที่เกี่ยวข้องกับความรักอย่างลึกซึ้ง” ʜᴇᴇꜱᴇᴜɴɢ กล่าว “คีย์เวิร์ดของอัลบั้มคือ ความรัก และแต่ละเพลงบอกเล่าเรื่องราวของความรักในรูปแบบที่แตกต่างกัน โดยพื้นฐานแล้วมันเป็นคือเรื่องเดียวที่เล่าผ่านเพลงที่แตกต่างกัน”
เพลงไตเติ้ลของอัลบั้ม </p>
<img src={en2Image} alt="Enhypen Concert" className="got-concert-image1" />
 <p className="text-en-image1">xᴏ (ᴏɴʟʏ ɪꜰ ʏᴏᴜ ꜱᴀʏ ʏᴇꜱ) คือเพลงสรุปธีมที่น่ารักของอัลบั้มได้อย่างสมบูรณ์แบบ โดยเป็นการบอกเล่าเรื่องราวของชายหนุ่มที่ พร้อมจะทุ่มเททุกสิ่งทุกอย่างเพื่อความรัก เพียงแค่ ‘คุณ’ อนุญาต และเพลงยังพิเศษยิ่งขึ้นตรงที่ได้ ᴊᴠᴋᴇ เจ้าขิงเพลงฮิตสุดละมุนของ ʙɪʟʟʙᴏᴀʀᴅ ʜᴏᴛ 100 ɢᴏʟᴅᴇɴ ʜᴏᴜʀ มาร่วมทำเพลงด้วยและได้เพิ่มความไพเราะให้เพลงด้วย
 ꜱᴜɴɢʜᴏᴏɴ เผยว่าเพลงนี้ สะท้อนให้เห็นถึงความสัมพันธ์ที่ขาดไม่ได้ระหว่าง ᴇɴʜʏᴘᴇɴ และแฟนด้อม ᴇɴɢᴇɴᴇ เพราะวง เติบโตและได้รับความแข็งแกร่งจากการยอมรับและความรักของแฟนๆครับ...ตอนเราได้ยินทำนองนี้ครั้งแรก มันติดหูมากจนเราคิดว่าทุกคนน่าจะชอบมันครับ</p>
 <div className="image-grid">
   {images.map((image, index) => (
     <img key={index} src={image} alt={`img-${index + 1}`} className="grid-image" />
   ))}
 </div>
   
      <p className="text-en-image1">การออกแบบท่าเต้นของเพลงยังรวบรวมความรู้สึกขี้เล่นของความโรแมนติกที่มีเสน่ห์ ท่าเต้นโดดเด่นเป็นพิเศษด้วยการเคลื่อนไหวที่เป็นธรรมชาติซึ่งแสดงคำว่า xᴏ 
      “เราพยายามลดเสน่ห์อันมืดมนของอัลบั้มก่อนๆของเราลง และแสดงออกถึงความเท่ ความน่ารัก และความเซ็กซี่ผ่านท่าเต้นของเพลงไตเติ้ลใหม่” ᴊᴀᴋᴇ อธิบาย โดยเน้นย้ำถึงความพยายามที่ใส่ลงไปในการเคลื่อนไหว</p>
      {/* Video section */}
   <div className="video-container">
        <iframe
          width="860"
          height="515"
          src="https://www.youtube.com/embed/FPDYeRk2PO8?si=lrqILJEnedjxGikk"
          title="YouTube video player"
          frameBorder="0"
          allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
          allowFullScreen
        ></iframe>
      </div>
      
      <p className="text-en-image1">ฟังเพลง ‘xᴏ (ᴏɴʟʏ ɪꜰ ʏᴏᴜ ꜱᴀʏ ʏᴇꜱ)’ ได้แล้ววันนี้ในทุกสตรีมมิ่งแพลตฟอร์ม และทาง ʏᴏᴜᴛᴜʙᴇ : ʜʏʙᴇ ʟᴀʙᴇʟꜱ</p>
</div>
    
  );
};

export default BusConcert;
